#include <stdio.h>
#include <locale.h>

int zadanie1();
int zadanie2();
int zadanie3();

int main()
{
    setlocale(LC_CTYPE, "RUS");
    zadanie1();
    zadanie2();
    zadanie3();
}

int zadanie1()
{
    printf("123\n"); // подзадание 1
    printf(" 1\n 2\n 3\n"); // подзадание 2
    printf(" 1\n\t 2\n\t 3\n"); // подзадание 3
    printf(" %1d\n %2d\n %3d\n %4d\n", 1, 2, 3, 4); // подзадание 4
    printf("%.3f\n", 12.234657); // подзадание 5
    printf("%.5f\n", 12.234657); // подзадание 6
    printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2); // подзадание 7
    printf("Деление %d на %d равно %d\n", 7, 5, 7 / 5); // подзадание 8
    printf("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4); // подзадание 9
    printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000); // подзадание 10.1
    printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000); // подзадание 10.2
    printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000); // подзадание 10.3
    printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000); // подзадание 10.4
    printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000); // подзадание 10.5
}

int zadanie2()
{
    int N, K;
    N = 10;
    K = 20;
    printf("Сейчас %d часов %d минут 00 секунд \n", N, K); // Сейчас 10 часов 20 минут 00 секунд
    printf("Идет %d минута суток \n", ((N * 60) + K)); // Идет 620 минута суток
    printf("До полуночи осталось %d часов и %d минут \n", 23-N, 60-K); // До полуночи осталось 13 часов и 40 минут
    printf("С 8.00 прошло %d секунд \n", ((N * 3600) + K * 60) - 8 * 3600); // С 8.00 прошло 8400 секуд
    printf("Текущий час = %1.2f суток и текущая минута = %1.2f часа \n", (N / 24.), (K / 60.)); // Текущий час = 0.42 суток и 0.33 минут
}

int zadanie3()
{
    float L = 333;
    float n = 2;
    int k = 3;
    int m = 1;
    printf("Дано:\n");
    printf("%9g\n%9g\n", n, L);
    printf("     -------\n");
    printf("Ответ:\n");
    printf("     %+06.1f\n", n / L);
}