#include <stdio.h>
#include <locale.h>

int main()
{
    setlocale(LC_CTYPE, "");

    int a = 10; // Исходные данные
    int x = 15; // Исходные данные
    int n = 133; // Исходные данные

    int S = 75 * a + (n - 75) * x; // Расчет заработка

    printf("Мальчик продал %d газет.\n", n); // Вывод результата
    printf("За первые 75 газет он заработал по %d руб.\n", a); // Вывод результата
    printf("За остальные %d газет он заработал по %d руб.\n", n - 75, x); // Вывод результата
    printf("Общий заработок мальчика: %d руб.\n", S); // Вывод результата

    return 0;
}